<!DOCTYPE html> 
<html lang="es"> 
<head> 
    <meta charset="UTF-8"> 
    <meta name="viewport" content="width=device-width, initialscale=1.0"> 
    <meta name="description" content="Historia de las aplicaciones web, sus orígenes, evolución y el impacto actual."> 
    <meta name="keywords" content="Historia, Web, Aplicaciones, Evolución"> 
    <title>Historia de Aplicaciones Web</title> 
    <style> 
        body { font-family: Arial, sans-serif; margin: 20px; } 
        nav a { margin-right: 15px; text-decoration: none; color: 
#2980B9; } 
        section { margin-bottom: 40px; } 
    </style> 
</head> 
<body> 
    <nav> 
        <a href="../index.html">Regresar</a> 
        <a href="index.html">Inicio</a> 
        <a href="historia.html">Historia Web</a> 
        <a href="cv.html">CV</a> 
    </nav> 
    <header> 
        <h1>Historia de Aplicaciones Web</h1> 
        <p>Explora los hitos hist&oacute;ricos de la web.</p> 
    </header> 

    
    <section id = "indice">
        <h2>&Iacute;ndice</h2>
        <p> <a href="#WEB 1.0">WEB 1.0</a> </p>
        <p> <a href="#WEB 2.0">WEB 2.0</a> </p>
        <p> <a href="#WEB 3.0">WEB 3.0</a> </p>
        <p> <a href="#WEB 4.0">WEB 4.0</a> </p>
    </section>

    <section id="WEB 1.0"> 
        <h2>WEB 1.0</h2> 
        

        <p>Surge del desarrollo de World Wide Web, de la mano de Tim Berners-Lee y junto 
            con la de la creaci&oacute;n HTTP (Hypertext Transfer Protocol) que en español significa 
            Protocolo de Transferencia de Hipertexto y HTML (Hypertext Markup Language) es un 
            lenguaje de marcado que se utiliza para crear p&aacute;ginas web</p>

        <p>La web 1.0 eran las webs est&aacute;ticas, que empezaron 
            a desarrollarse en los años 90. Solo permit&iacute;an la
            lectura, y las personas usuarias no pod&iacute;an interaccionar de
            ninguna forma.</p> 

        <p>En la web 1.0 la informaci&oacute;n era unidireccional y el papel de 
            las personas &uacute;nicamente era consumir el contenido.  </p>

        <p>Conexiones lentas: Se acced&iacute;a a internet mediante conexiones de m&oacute;dem dial-up, 
            lo que hacía que la carga de p&aacute;ginas fuera lenta.</p>

        <p> El elemento principal era el texto que se completaba con HTML, 
            hiperv&iacute;nculos y los primeros navegadores visuales. Si la persona 
            encargada de actualizar el contenido (el webmaster) no lo hacía, 
            no cambiaba, ya que era la &uacute;nica persona con la capacidad de interactuar
            con la p&aacute;gina web.</p>   
            
        <p>A pesar de ser la primera versi&oacute;n de internet, a mucha gente le resultaba 
            dif&iacute;cil utilizarla y navegar por ella, porque no ten&iacute;a en cuenta la usabilidad.  
            Las webs m&aacute;s conocidas de esa &eacute;poca eran Netscape Navigator (1994-2008) o AltaVista (1995-2013)</p>
        
        <p>Esta etapa sent&oacute; las bases para la evoluci&oacute;n de la web, dando paso posteriormente a la Web 2.0, 
            caracterizada por la interactividad y el contenido generado por los usuarios.</p>

            <a href="#WEB 2.0">Siguiente: WEB 2.0</a> 
    </section> 
    <section id="WEB 2.0">
        
        <h2>WEB 2.0</h2> 
        <p>La web 2.0 es la web din&aacute;mica. El contenido no se consume de forma pasiva, sino que las personas usuarias
            podemos crearlo y personalizarlo. Es la segunda generaci&oacute;n de la World Wide Web, que comenz&oacute; a mediados
            de la primera d&eacute;cada de este siglo. </p>
        
        <p>El objetivo de la web 2.0 es compartir conocimiento. Permite a los usuarios interactuar con otros usuarios 
            o cambiar el contenido del sitio web, algo que no se podía hacer en la web 1.0. </p>    

        <p>El consumidor es ahora quien genera el contenido de calidad, en lugar del modelo tradicional en el que el 
            contenido era producido por unos pocos y consumido por muchos.</p>

        <p>Es la &eacute;poca dorada de los foros de Internet y de las primeras redes sociales, como myspace (2003). 
            La web 2.0 cambi&oacute; las sociedades y la forma de recibir la informaci&oacute;n, que antes &uacute;nicamente se recib&iacute;a a
            trav&eacute;s de la prensa.</p>
        
        <p>Es en este punto cuando empezaron a salir a la luz los primeros gestores de contenido o CMS, y el diseño y 
            la administración de contenidos de las p&aacute;ginas web tuvieron un salto brutal.</p>

            <a href="#WEB 3.0">Siguiente: WEB 3.0</a> 
    </section>    

    <section id="WEB 3.0">
        
        <h2>WEB 3.0</h2> 
        <p>La Web 3.0 es la web sem&aacute;ntica. Es la nueva generación de Internet, en la que la informaci&oacute;n es m&aacute;s f&aacute;cilmente 
            accesible y comprensible. Es la web inteligente, en la nube, las aplicaciones y la web “multidispositivo”. </p>
        
        <p>Uno de los pilares fundamentales de la Web 3.0 es la descentralizaci&oacute;n. En lugar de que los datos sean almacenados 
            en servidores centralizados controlados por grandes corporaciones, se distribuyen en redes basadas en blockchain. 
            Esto no solo aumenta la seguridad y privacidad de los usuarios, sino que también reduce la dependencia de intermediarios
            y permite una mayor autonom&iacute;a sobre la informaci&oacute;n personal.</p>
        
        <p>Otra caracter&iacute;stica clave es la inteligencia artificial y la automatizaci&oacute;n. Los algoritmos avanzados y el aprendizaje autom&aacute;tico
            permiten una web m&aacute;s inteligente, capaz de comprender y procesar datos de manera m&aacute;s eficiente.</p>

        <p> Gracias a la Web Sem&aacute;ntica, 
            los motores de b&uacute;squeda y asistentes virtuales pueden interpretar mejor las intenciones de los usuarios, 
            ofreciendo respuestas m&aacute;s precisas y relevantes. </p>

        <p>Además, la Web 3.0 impulsa el desarrollo de econom&iacute;as digitales descentralizadas, con el uso de criptomonedas y contratos inteligentes
            que permiten transacciones seguras sin necesidad de intermediarios. Esto facilita la creaci&oacute;n de nuevas formas de interacción digital,
            como los NFT (tokens no fungibles) y las aplicaciones descentralizadas (dApps), que est&aacute;n revolucionando sectores como el arte, los videojuegos
            y las finanzas.</p>
            <a href="#WEB 4.0">Siguiente: WEB 4.0</a> 
    </section> 

    <section id="WEB 4.0">
        
        <h2>WEB 4.0</h2> 
        <p>La Web 4.0 representa la siguiente evoluci&oacute;n de internet, orientada a la hiperconectividad, la automatizaci&oacute;n avanzada y la integraci&oacute;n 
            total entre el mundo digital y el f&iacute;sico. A diferencia de la Web 3.0, que se centra en la descentralizaci&oacute;n y el uso de blockchain, la 
            Web 4.0 busca una interacción a&uacute;n m&aacute;s inteligente y fluida entre humanos y m&aacute;quinas, haciendo uso de inteligencia artificial avanzada, 
            computaci&oacute;n cu&aacute;ntica y el Internet de las Cosas (IoT).</p>

        <p>Uno de los pilares fundamentales de la Web 4.0 es la interacci&oacute;n en tiempo real entre humanos y sistemas inteligentes. Se espera que esta
             fase impulse el desarrollo de asistentes virtuales m&aacute;s sofisticados, capaces de anticiparse a las necesidades del usuario y ofrecer 
             respuestas altamente personalizadas. Estos sistemas utilizar&aacute;n tecnolog&iacute;as como el procesamiento del lenguaje natural, redes neuronales 
             avanzadas y aprendizaje profundo para mejorar la experiencia digital.</p>

        <p>Adem&aacute;s, la Web 4.0 dar&aacute; paso a un entorno completamente integrado entre lo f&iacute;sico y lo digital, gracias a dispositivos conectados en tiempo 
            real. Conceptos como las ciudades inteligentes, la realidad aumentada y la realidad virtual evolucionar&aacute;n a un nivel donde las fronteras 
            entre lo real y lo virtual serán pr&aacute;cticamente invisibles. Por ejemplo, la educaci&oacute;n, el comercio y el entretenimiento podrían realizarse 
            en espacios h&iacute;bridos, donde la interacci&oacute;n con la tecnolog&iacute;a sea natural y sin interrupciones.</p>

        <p>Otro aspecto clave ser&aacute; la computaci&oacute;n cu&aacute;ntica y el procesamiento masivo de datos, lo que permitir&aacute; c&aacute;lculos extremadamente r&aacute;pidos y la 
            optimizaci&oacute;n de sistemas complejos en &aacute;reas como la medicina, la seguridad y la inteligencia artificial. Esto facilitar&aacute; la toma de 
            decisiones aut&oacute;nomas en sectores cr&iacute;ticos como la salud, la movilidad y la econom&iacute;a global.</p>    

        <a href="#indice">&Iacute;ndice</a> 
    </section>
</body>
</html>